{
  "backend/main.mo": "Minimal Motoko actor with no functions defined.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs for build planning.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of key frontend files and components.",
  "frontend/index.css": "Tailwind base stylesheet defining custom OKLCH color tokens and dark mode variables.",
  "frontend/index.html": "HTML entry point with SEO metadata, Open Graph tags, and root mounting element.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and routes for all main pages including Pests.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, navigation links including Pests, service shortcuts, and contact info.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with logo, navigation links including Pests, call-to-action phone number, and mobile sheet menu.",
  "frontend/src/components/marketing/CustomerReviewsSection.tsx": "Section displaying testimonial cards with reviewer names, star ratings, review text, and optional service labels.",
  "frontend/src/components/services/SafetyNotesSection.tsx": "Renders a safety information section with cards listing preparation, aftercare, and eco‑friendly guidelines.",
  "frontend/src/components/services/TreatmentProcessSection.tsx": "Displays a multi-step treatment process using cards with icons, numbers, and descriptions.",
  "frontend/src/content/pests.ts": "Exports pest data including identification details, signs of infestation, and prevention tips.",
  "frontend/src/content/testimonials.ts": "Provides a list of customer testimonials with names, ratings, reviews, and optional service types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication, identity loading, and login state management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks with no current functionality.",
  "frontend/src/index.css": "Defines Tailwind base styles and a green-themed light/dark color palette for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company story, mission, hero section, and core values grid using icons and images.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact methods including phone, email, business hours, and a hero section with styled cards.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero banner, feature highlights, service previews, and customer reviews section.",
  "frontend/src/pages/PestsPage.tsx": "Shows a pest identification guide with cards listing identification details, infestation signs, and prevention tips.",
  "frontend/src/pages/ServicesPage.tsx": "Provides a services overview with detailed service cards, descriptions, feature lists, and supportive sections.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current website requirements, features, and architectural notes for the Nexeme Pest Control site."
}