{
  "kind": "build_request",
  "title": "Marketing website for Nexeme Pest Control Pvt Ltd (contact details included)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a responsive marketing website for “Nexeme Pest Control Pvt Ltd” with clear business branding and the following sections/pages: Home, Services, About, and Contact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Nexeme pest control pvt ltd ... Please create a website for me"
        ]
      },
      "acceptanceCriteria": [
        "Site has at least 4 navigable sections/pages: Home, Services, About, Contact.",
        "Navigation works on desktop and mobile (mobile menu/collapsible nav is acceptable).",
        "All pages are responsive and readable on common breakpoints (mobile/tablet/desktop)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Display the provided contact information prominently on the Contact section/page and in the site footer: Phone: 9053146001, Email: inkhiya14@gmail.com.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Mobile no 9053146001",
          "Email id inkhiya14@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "Contact page shows phone number and email address exactly as provided.",
        "Footer contains the same phone number and email address.",
        "Phone is clickable as a tel: link and email is clickable as a mailto: link."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a Services section that lists common pest control service categories in clear English (e.g., general pest control, termite control, cockroach control, rodent control, mosquito control, bed bug control) with short descriptions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Services section lists at least 5 service categories with short descriptions.",
        "Text is in English and formatted for easy scanning (cards or a simple grid/list)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add basic SEO and sharing metadata (document title, meta description, and an Open Graph title/description) using the business name “Nexeme Pest Control Pvt Ltd”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Browser tab title includes “Nexeme Pest Control Pvt Ltd”.",
        "A meta description exists and is relevant to pest control services.",
        "Open Graph title and description tags are present."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Establish a cohesive, distinctive visual theme (colors, typography, spacing, and component styling) suitable for a professional pest control business, and apply it consistently across all pages. Avoid a blue/purple primary palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Theme is consistent across navigation, buttons, headings, and section layouts.",
        "Primary palette is not blue/purple-dominant (unless used only as minor accents).",
        "Site looks professionally branded and not like default template styling."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add the required generated images to the project as static assets under frontend/public/assets/generated and use them on the site (logo in header/footer; hero image on Home).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Generated images exist in frontend/public/assets/generated with the specified filenames.",
        "Logo is rendered in the header and footer.",
        "Hero image is rendered on the Home page without loading via the backend."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing website text.",
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose these components instead).",
    "Do not introduce third-party authentication providers; only Internet Identity is supported (not required for this website).",
    "Backend must remain a single Motoko actor if any backend changes are later introduced."
  ],
  "nonGoals": [
    "Customer login/dashboard.",
    "Online payments or subscriptions.",
    "Real-time chat or WhatsApp/SMS/email integrations.",
    "External database integrations (Postgres/MySQL/Mongo/Redis)."
  ],
  "imageRequirements": {
    "required": [
      "Simple professional logo mark for “Nexeme Pest Control Pvt Ltd” with a clean pest-control motif (nexeme-logo.dim_512x512.png)",
      "Wide homepage hero banner image showing a clean, modern home/service scene with subtle pest-control theme, no text (nexeme-hero.dim_1600x900.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}