{
  "kind": "build_request",
  "title": "Add customer reviews, pests & insects details, and more detailed treatment information",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Add a \"Customer Reviews\" (testimonials) section to the marketing website, with multiple review cards showing reviewer name, star rating, short review text, and (optional) service type.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "With customer reviews ... on this website ..."
        ]
      },
      "acceptanceCriteria": [
        "Home page includes a clearly labeled \"Customer Reviews\" section.",
        "At least 6 testimonials are displayed as consistent cards (name + rating + review text; service type optional).",
        "Section is responsive (looks good on mobile and desktop) and matches the site’s existing visual theme.",
        "No backend is required to view testimonials (static content is acceptable)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Create a new \"Pests & Insects\" page that provides clear identification and basic info for common pests/insects relevant to pest control (e.g., cockroaches, termites, mosquitoes, bed bugs, ants, rodents), and add navigation links to this page from the header and footer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "... Pests and Insects details on this website ..."
        ]
      },
      "acceptanceCriteria": [
        "A new route/page exists at a clear URL (e.g., /pests) and is accessible from both the SiteHeader navigation and SiteFooter quick links.",
        "The page includes a grid/list of common pests/insects where each item includes: name, how to identify, typical signs, and basic prevention tips (English text).",
        "The page uses existing UI components and styling conventions (cards/sections) and is responsive.",
        "Existing routes (Home/Services/About/Contact) continue to work unchanged."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Expand the existing Services content to include more detailed information about effective pest treatment methods, including a clear \"Our Treatment Process\" section (inspection, identification, treatment, prevention, follow-up) and safety notes (family/pet safety and eco-friendly options) using user-facing English text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "... more effective pest treatment details alsoare mentioned on this website"
        ]
      },
      "acceptanceCriteria": [
        "Services page includes a dedicated section describing the end-to-end treatment process in clear steps.",
        "Services page includes safety guidance (e.g., preparation before treatment, aftercare, child/pet considerations) written in plain English.",
        "Content is presented in a structured, scannable layout (cards, numbered steps, or accordions) consistent with the current design system.",
        "No backend changes are required for these additional details."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep the application as a static marketing site (no requirement for review submission, moderation, or persistence unless explicitly requested later).",
    "Backend must remain single-actor; avoid adding backend work unless necessary (this change set should be frontend-only)."
  ],
  "nonGoals": [
    "Building a backend/admin panel to create, edit, or store customer reviews.",
    "Integrating third-party review platforms (e.g., Google Reviews) or external APIs.",
    "Adding real-time features (chat, live updates) or third-party authentication beyond existing Internet Identity support."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}