{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Marketing site content expansion: Customer Reviews, Pests page, and Treatment Process details",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Add a responsive Customer Reviews (testimonials) section to the Home page using static review cards with star ratings.",
      "acceptanceCriteria": [
        "Home page includes a clearly labeled \"Customer Reviews\" section.",
        "At least 6 testimonials are displayed as consistent cards (name + rating + review text; service type optional).",
        "Section is responsive (looks good on mobile and desktop) and matches the site’s existing visual theme.",
        "No backend is required to view testimonials (static content is acceptable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/CustomerReviewsSection.tsx",
          "operation": "create",
          "description": "Create a reusable Customer Reviews section component rendering a responsive grid of testimonial cards (reviewer name, star rating, review text, optional service type). Use shadcn-ui Card primitives for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/content/testimonials.ts",
          "operation": "create",
          "description": "Add a static testimonials data module (at least 6 entries) to keep Home page content clean and ensure no backend dependency."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Wire the new CustomerReviewsSection into the Home page with a clearly labeled \"Customer Reviews\" heading, placed in an appropriate marketing flow and styled to match existing sections. Ensure mobile/desktop responsiveness. Use existing shadcn-ui components already used on the page (e.g., Card/Button); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create a new Pests & Insects page at /pests with a responsive pest info grid and add header/footer navigation links to it.",
      "acceptanceCriteria": [
        "A new route/page exists at a clear URL (e.g., /pests) and is accessible from both the SiteHeader navigation and SiteFooter quick links.",
        "The page includes a grid/list of common pests/insects where each item includes: name, how to identify, typical signs, and basic prevention tips (English text).",
        "The page uses existing UI components and styling conventions (cards/sections) and is responsive.",
        "Existing routes (Home/Services/About/Contact) continue to work unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PestsPage.tsx",
          "operation": "create",
          "description": "Create the \"Pests & Insects\" page with a clear hero/intro and a responsive grid/list of pests (e.g., cockroaches, termites, mosquitoes, bed bugs, ants, rodents). Each pest item must include name, identification notes, typical signs, and prevention tips (English). Use shadcn-ui Card for consistent presentation; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/content/pests.ts",
          "operation": "create",
          "description": "Add a static pests/insects content module that supplies the Pests page grid/list data (name, identification, signs, prevention tips) to keep the page component focused on layout."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new /pests route in the TanStack Router route tree and wire it to the new PestsPage component, ensuring existing routes remain unchanged."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Add a \"Pests & Insects\" navigation link (e.g., label \"Pests\") pointing to /pests in both desktop and mobile navigation, keeping active-state styling consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Add a \"Pests & Insects\" quick link to /pests within the footer navigation area, matching existing link styling and layout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Expand the Services page with a structured \"Our Treatment Process\" section and clear safety notes in plain English.",
      "acceptanceCriteria": [
        "Services page includes a dedicated section describing the end-to-end treatment process in clear steps.",
        "Services page includes safety guidance (e.g., preparation before treatment, aftercare, child/pet considerations) written in plain English.",
        "Content is presented in a structured, scannable layout (cards, numbered steps, or accordions) consistent with the current design system.",
        "No backend changes are required for these additional details."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/services/TreatmentProcessSection.tsx",
          "operation": "create",
          "description": "Create a structured \"Our Treatment Process\" section component presenting the steps (inspection, identification, treatment, prevention, follow-up) in a scannable layout (e.g., numbered cards/steps) consistent with the current theme. Use shadcn-ui Card primitives where appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/services/SafetyNotesSection.tsx",
          "operation": "create",
          "description": "Create a safety notes section component covering family/pet safety, preparation guidance, aftercare, and eco-friendly options in plain English, using a scannable layout consistent with existing sections. Use shadcn-ui Card primitives where appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Wire TreatmentProcessSection and SafetyNotesSection into the Services page in a logical position (after service listings and/or before the closing CTA), ensuring the layout remains responsive and consistent with the existing design system. Use existing shadcn-ui components already used on the page (Card/Button); verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}